   
Процедура ОтправитьСообщение() Экспорт

	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json"); 
	
	ЗапросHTTP = Новый HTTPЗапрос("bot" + Константы.ВКМ_ТокенУправленияТелеграммБотом.Получить() + "/sendMessage", Заголовки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Текст = Выборка.ТекстСообщения; 
		
		Данные = Новый  Структура;
		Данные.Вставить("chat_id", Константы.ВКМ_ИндикаторГруппыДляОповещения.Получить());
		Данные.Вставить("text",Текст);
		
		
		ЗаписьJSON = Новый  ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		Строказапроса = ЗаписьJSON.Закрыть(); 
		
		ЗапросHTTP.УстановитьТелоИзСтроки(Строказапроса); 
		
		Ответ = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если Ответ.КодСостояния <> 200 Тогда
			
			Ошибка = Ответ.ПолучитьТелоКакСтроку();
			
			Ответ = ОписаниеОшибки();
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка при запросе: с ТЕЛЕГРАМ", УровеньЖурналаРегистрации.Ошибка,,, Ошибка);
		Иначе 
			ДокОбьект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбьект.Удалить();	
		КонецЕсли;
		
	КонецЦикла;
	   
КонецПроцедуры	
   
   
   