
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// регистр ВКМ_ВыполненныеКлиентуРаботы 
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; 
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор КАК Договор,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_СуммаЧаса КАК ДоговорВКМ_СуммаЧаса,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата)
	|	И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
	|	И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_ДатаНачала <= ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот
	|	И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_ДатаОкончания >= ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
	|	ВременнаяТаблица.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВременнаяТаблица.Клиент КАК Клиент,
	|	ВременнаяТаблица.Договор КАК Договор,
	|	ВременнаяТаблица.ДоговорВКМ_СуммаЧаса КАК ДоговорВКМ_СуммаЧаса,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&Период,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВременнаяТаблица.Специалист КАК Специалист
	|					ИЗ
	|						ВременнаяТаблица КАК ВременнаяТаблица)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВременнаяТаблица.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);		
	
	Если  Запрос.Выполнить().Пустой() Тогда 
		
		Отказ = Истина;                                           
		Текст = СтрШаблон("Срок договора %1 истек, заключите новый договор!", Договор); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		
	Иначе  
		
		Выборка = Запрос.Выполнить().Выбрать();	
		
		Пока Выборка.Следующий() Цикл  
		
			Если Не ЗначениеЗаполнено(Выборка.Сотрудник) Тогда  
				
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Специалисту не установлен процент оплаты от работ на дату документа!!!");
				
			КонецЕсли;
			
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = Выборка.Клиент;
			Движение.Договор = Выборка.Договор;
			Движение.СуммаКоличестваЧасов = Выборка.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = Выборка.ДоговорВКМ_СуммаЧаса * Выборка.ЧасыКОплатеКлиенту;  
			
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.ЧасовКОплате = Выборка.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.ДоговорВКМ_СуммаЧаса 
			* Выборка.ПроцентОтРабот / 100;
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		
		//@skip-check undefined-variable
		ВКМ_ТекстДляТелеграм.ДобавлениеНовойЗаявки(Ссылка);
		
	КонецЕсли;	
	
КонецПроцедуры