
&НаСервере
Процедура ПриОткрытииНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ)) КАК КоличествоДней,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.НомерСтроки";
	
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоДней > 28 Тогда 
			Строка = Объект.ОтпускаСотрудников.НайтиПоИдентификатору(Выборка.НомерСтроки - 1);	
		   	Строка.Более28Дней = Истина;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	Если ЭтотОбъект.Модифицированность Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запишите документ!");
	Иначе
				
		Данные = Новый Структура("СсылкаХранилища",  Данные());
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", Данные);
		
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Функция Данные()
	
	ДанныеСотрудников = Новый ТаблицаЗначений;
	ДанныеСотрудников.Колонки.Добавить("Сотрудник");
	ДанныеСотрудников.Колонки.Добавить("ДатаНачала");
	ДанныеСотрудников.Колонки.Добавить("ДатаОкончания");
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		НоваяСтрока = ДанныеСотрудников.Добавить();
		НоваяСтрока.Сотрудник = Строка.Сотрудник;
		НоваяСтрока.ДатаНачала = Строка.ДатаНачала;
		НоваяСтрока.ДатаОкончания = Строка.ДатаОкончания;
		
	КонецЦикла; 

	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДанныеСотрудников);				
	
	Возврат АдресВременногоХранилища;
	
КонецФункции
