
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Заголовок = "Анализ графика";
	ЭтотОбъект.АвтоЗаголовок = Ложь; 
	
	ДиаграммаГанта.Очистить();
	
	СсылкаХранилища = ЭтотОбъект.Параметры.СсылкаХранилища;
	
	Таблица = ПолучитьИзВременногоХранилища(СсылкаХранилища);
	
	Для Каждого Строка Из Таблица Цикл
		
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		Серия.Текст = "Отпуск";
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания; 
		
	КонецЦикла;
	
	УдалитьИзВременногоХранилища(СсылкаХранилища);
	
КонецПроцедуры
