
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь; 
	
	//++__ВКМ		
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда 
		
		ВКМ_ДобавлениеРеквезитовНаФорму();
		
	КонецЕсли; 
	//--__ВКМ
	
КонецПроцедуры  

//++__ВКМ
&НаСервере
Процедура ВКМ_ДобавлениеРеквезитовНаФорму()
				
			ЭлементыФормы = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
			
			ЭлементыФормы = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
			
			ЭлементыФормы = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			
			ЭлементыФормы = Элементы.Добавить("СуммаЧаса", Тип("ПолеФормы")); 	  
			ЭлементыФормы.Вид = ВидПоляФормы.ПолеВвода;
			ЭлементыФормы.ПутьКДанным = "Объект.ВКМ_СуммаЧаса";
		
		КонецПроцедуры
//--__ВКМ		

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
		
	//++__ВКМ
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата") Тогда 
		
		ВКМ_ДобавлениеРеквезитовНаФорму();
		
	КонецЕсли;
	//--__ВКМ
	
КонецПроцедуры

