

Процедура ДобавлениеНовойЗаявки(Знач Документ) Экспорт
	
	НомерДокументаБезНулей = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Документ.Номер);
	
	Текст = СтрШаблон("Заявка на работы № %1, от %2, Клиент: %3, специалист - %4, дата проведения работ %5  в %6, Описание проблемы: %7", НомерДокументаБезНулей, Формат(Документ.Дата,"ДЛФ=DD") , Документ.Клиент, Документ.Специалист, 
			Формат(Документ.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy") , Формат(Документ.ВремяНачалаРабот,"ДЛФ=T"), Документ.ОписаниеПроблемы);  	

	СообщениеТелеграм = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент(); 
	СообщениеТелеграм.ТекстСообщения = Текст;
	СообщениеТелеграм.Записать();  
		
КонецПроцедуры 
