
Функция МассовоеСозданиеДокРеализация(ДатаНачала, ДатаОкончания) Экспорт
	
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &ВКМ_ДатаНачала
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= &ВКМ_ДатаОкончания
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &МесяцРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Ссылка КАК СсылкаДоговор,
	|	ВТ_Договоры.Организация КАК Организация,
	|	ВТ_Договоры.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(ВТ_Реализация.Ссылка, 1) КАК СсылкаРеализация
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	|		ПО ВТ_Договоры.Ссылка = ВТ_Реализация.Договор.Ссылка";
	
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("ВКМ_ДатаНачала", НачалоМесяца(ДатаНачала));  
	Запрос.УстановитьПараметр("ВКМ_ДатаОкончания", КонецМесяца(ДатаОкончания));
	Запрос.УстановитьПараметр("МесяцРеализации", Месяц(ДатаНачала));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	РезультатТЗ = Новый ТаблицаЗначений;
	РезультатТз.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	РезультатТз.Колонки.Добавить("РеализацияТоваровУслуг", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.СсылкаРеализация = 1 Тогда
			
			ДокументРеализация = Выборка.СсылкаРеализация.ПолучитьОбъект();
			ДокументРеализация.ВыполнитьАвтозаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			
		Иначе        
			
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
			ДокументРеализация.Заполнить(Неопределено);
			ДокументРеализация.Дата = КонецМесяца(ДатаОкончания);
			ДокументРеализация.Договор = Выборка.СсылкаДоговор;
			ДокументРеализация.Организация = Выборка.Организация;
			ДокументРеализация.Контрагент = Выборка.Контрагент;
			ДокументРеализация.ВыполнитьАвтозаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
		Запись = РезультатТЗ.Добавить();
		Запись.Договор = Выборка.СсылкаДоговор;
		Запись.РеализацияТоваровУслуг =  ДокументРеализация.Ссылка;    
		
	КонецЦикла;	
		
	Возврат РезультатТз;
	
КонецФункции